document.addEventListener("DOMContentLoaded", (event) =>{
	

	//대분류(업종) 요소 가져오기
	const sectorCategoryOption = document.getElementById("sectorCategory").value;
	console.log(sectorCategoryOption);
	
	//중분류(지역-시,도 카테고리) 요소 가져오기
	const bigCategoryOption = document.getElementById("bigAreaCategory");
	
	//중분류별 소분류(지역-시,군,구 카테고리) 종류
	const smallCategoryOption = {
			"서울특별시": ["종로구","중구","용산구","성동구","광진구","동대문구","중랑구","성북구","강북구","안동시","도봉구","노원구","은평구","서대문구","마포구","양천구","강서구","구로구","금천구","영등포구","동작구","관악구","서초구","강남구","송파구","강동구"],
			"경기도" : ["수원시","고양시","용인시","성남시","부천시","화성시","안산시","남양주시","안양시","평택시","시흥시","파주시","의정부시","김포시","광주시","광명시","군포시","하남시","오산시","양주시","이천시","구리시","안성시","포천시","의왕시","양평군","여주시","동두천시","가평군","과천시","연천군" ],
			"충청북도" : ["청주시","충주시","제천시","보은군","옥천군","영동군","증평군","진천군","괴산군","음성군","단양군" ],
			"충청남도" : ["천안시","공주시","보령시","산시","서산시","논산시","계룡시","당진시","금산군","부여군","서천군","청양군","홍성군","예산군","태안군" ],
			"전라남도" : ["목포시","여수시","순천시","나주시","광양시","담양군","곡성군","구례군","고흥군","보성군","화순군","장흥군","강진군","해남군","영암군","무안군","함평군","영광군","장성군","완도군","진도군","신안군" ],
			"경상북도" : ["포항시","경주시","김천시","안동시","구미시","영주시","영천시","상주시","문경시","경산시","군위군","의성군","청송군","영양군","영덕군","청도군","성주군","칠고군","예천군","봉화군","울진군","울릉군" ],
			"경상남도" : ["창원시","진주시","통영시","사천시","김해시","밀양시","거제시","양산시","의령군","함안군","창녕군","고성군","남해군","하동군","산청군","함양군","거창군","합천군" ],
			"부산광역시" : ["중구","서구","동구","영도구","부산진구","동래구","남구","북구","해운대구","거제시","사하구","금정구","강서구","연제구","수영구","사상구","기장군" ],
			"인천광역시" : ["강화군","옹진군","중구","동구","미추홀구","연수구","남동구","부평구","계양구","서구" ],
			"대구광역시" : ["중구","동구","서구","남구","북구","수성구","달서구","달성군" ],
			"광주광역시" : ["동구","서구","남구","북구","광산구" ],
			"울산광역시" : ["중구","남구","동구","북구","울주군" ],
			"세종특별자치시" : "세종특별자치",
			"강원특별자치도" : ["춘천시","원주시","강릉시","동해시","태백시","속초시","삼척시","홍천군","횡성군","","영월군","평창군","정선군","철원군","화천군","양구군","인제군","고성군","양양군" ],
			"전북특별자치도" : ["전주시","군산시","익산시","정읍시","남원시","김제시","완주군","진안군","무주군","","장수군","임실군","순창군","고창군","부안군" ],
			"제주특별자치도" : ["제주시","서귀포시" ]
	};
	
	
	document.getElementById("bigAreaCategory").addEventListener("change", 

		//중분류에서 가져온 소분류 update해서 카테고리 보여주는 함수
		()=>{
			const bigAreaCategory = document.getElementById("bigAreaCategory").value;
			const smallAreaCategory = document.getElementById("smallAreaCategory");
			console.log(smallAreaCategory);
			smallAreaCategory.innerHTML = "<option value='전체' selected> 전체 </option>";  // 초기화 
		 	//
		 	
		    if(bigAreaCategory) {
		        smallCategoryOption[bigAreaCategory].forEach(item => {
		            let option = document.createElement("option");
		            option.value = item;
		            option.text = item;
		            smallAreaCategory.appendChild(option);
		        });
		    }
		}
	)
	
	
	
	
	//검색 버튼 누르면 카테고리별로 필터링되어서 목록을 수정해주는 함수
	function showSearchResult(){
		const searchButton = document.querySelectorAll()
	}

})